modules/api/controllers/AuthController.php

     public function actionRegister()
     {
          $in = \Yii::$app->request->post();

          $email = $in['email'];
          $password = $in['password'];
          $username = $in['username'];

          $user = User::find()
               ->where(['email' => $email])
               ->orWhere(['username' => $username])
               ->one();
          if ($user) {
               throw new ForbiddenHttpException('User has already been taken');
          }

          if ($email && $password && $username) {

               $user = new User();

               $user->email = $email;
               $user->password = $password;
               $user->username = $username;
               $user->created_at = time();
               $user->updated_at = time();
               $user->save();
---
SELECT * FROM "user" WHERE ("email"='student@studerus.ru') OR ("username"='student')
INSERT INTO "user" ("email", "username", "created_at", "updated_at", "login_locked_until", "failed_login_attempts", "password_hash") VALUES ('student@studerus.ru', 'student', 1683029494, 1683029494, NULL, NULL, '$2y$13$2OuiofzjIFXUe.Dx.ejc9.leJIBVq770B8iim5es8akMMROi8TF.2') RETURNING "id"

               );
               Yii::debug('$refresh_token', $refresh_token);
               $user->refresh_token = $refresh_token;
               $userSaved = $user->save();
---
INSERT INTO "user" ("email", "username", "created_at", "updated_at", "login_locked_until", "failed_login_attempts", "password_hash", "refresh_token_hash") VALUES ('student2@studerus.ru', 'student2', 1683029215, 1683029215, NULL, NULL, '$2y$13$eXmlA8A9l/V75Admy.9ZruHBrwcLgGwCHByv/dHrNiS8OEf164f2i', '$2y$13$3dtAqAufWkgalQlVAag1eeHWK6X5ZKua/6AJeFjoV596NSiRyFx3G') RETURNING "id"
UPDATE "user" SET "password_hash"='$2y$13$BWfQqdjM.sr0AGLmUn.iU.6kRLqmLFtv35b5L0DSLa.awvUciGnm6', "refresh_token_hash"='$2y$13$b1WT7pzxmg1IM4oe3hjeaO0SMFAqKnyr24GMDpusEjl9ES17chQFK' WHERE "id"=17

     public function actionLogin()
     {
          $in = \Yii::$app->request->post();

          $email = $in['email'];
          $password = $in['password'];
          $username = $in['username'];

          $user = User::find()
               ->where(['email' => $email])
               ->orWhere(['username' => $username])
               ->one();
---
SELECT * FROM "user" WHERE ("email"='student1@studerus.ru') OR ("username"='student1')

                         ]
                    );
                    $user->refresh_token = $refresh_token;
                    $userSaved = $user->save();
---
UPDATE "user" SET "refresh_token_hash"='$2y$13$dkHLw/6VtdyQk77jn4VNY.zdkBBncvwjfuK6LqJATbsv8hRRraL/W' WHERE "id"=14

     public function actionRefresh()
     {
          $refresh_token = Yii::$app->request->headers->get('Authorization');
          $refresh_token = substr($refresh_token, 7);

          $decoded = User::getUserDataFromJWT($refresh_token);

          $user = User::find()
               ->where(['id' => $decoded->data->user_id])
               ->one();

          if ($user) {
               if (Yii::$app->security->validatePassword($refresh_token, $user->refresh_token_hash)) {

                    $refresh_token = $user->generateRefreshToken(
                         [
                              'user_id' => $user->id,
                         ]
                    );
                    $user->refresh_token = $refresh_token;

                    $userSaved = $user->save();
---
SELECT * FROM "user" WHERE "id"=13
UPDATE "user" SET "refresh_token_hash"='$2y$13$xrkqkkXTPErdGCgtaRYDa.Rxf8ZKRHKAZDrXlMRQT2yVNjZlyWwuG' WHERE "id"=13

                         $out['user'] = $user->getAttributes();
                    }
               } else {
                    $user->updateFailedLoginAttempts(false);
---
UPDATE "user" SET "refresh_token_hash"='$2y$13$gfbqAyicdkFnsdeCgoVRYulc8CrNCx2RW4W/Q6tJmy7X0e9XSnwz6' WHERE "id"=8