modules/api/controllers/NoteController.php

SELECT * FROM "user" WHERE "id" IS NULL
---
    public function beforeAction($action)
    {
        $requestMethod = Yii::$app->request->getMethod();
        if ($requestMethod !== 'OPTIONS') {

            $jwt = Yii::$app->request->headers->get('Authorization');
            $jwt = substr($jwt, 7);

            if (!$jwt) {
                throw new \yii\web\UnauthorizedHttpException('Token not provided.');
            }

            $decoded = User::getUserDataFromJWT($jwt);

            Yii::debug("asdadasdasd", $decoded->data->user_id);
            $user = User::find()
                ->where(['id' => $decoded->data->user_id])
                ->one();

SELECT * FROM "note" WHERE "user_id"=8
---
    public function actionGetNote()
    {
        $user = Yii::$app->user->identity;

        if ($user) {
            $notes = Note::find()->where(['user_id' => $user->id])->all();

INSERT INTO "note" ("user_id", "title", "content", "created_at", "updated_at") VALUES (8, 'New note', 'New idea', 1682840093, 1682840093) RETURNING "id"
INSERT INTO "note" ("user_id", "title", "content", "created_at", "updated_at") VALUES (17, 'New note', 'New idea', 1683029512, 1683029512) RETURNING "id"
---
    public function actionCreateNote()
    {
        $in = \Yii::$app->request->post();

        $note = new Note();

        $user = Yii::$app->user->identity;

        if ($user) {
            $note->user_id = $user->id;
            $note->title = $in['title'];
            $note->content = $in['content'];
            $note->created_at = time();
            $note->updated_at = time();

            if ($note->save()) {

SELECT * FROM "note" WHERE "id"='2'
DELETE FROM "note" WHERE "id"=2
---
    public function actionDeleteNote()
    {
        $id = Yii::$app->request->get('id');


        $model = Note::findOne($id);

        if (!$model) {
            throw new \yii\web\NotFoundHttpException('Записка не найдена.');
        }

        $user = Yii::$app->user->identity;

        if ($user && $model->user_id == $user->id) {
            if ($model->delete()) {