models/User.php

    public function updateFailedLoginAttempts($successfulLogin)
    {
        if ($successfulLogin) {
            $this->failed_login_attempts = 0;
            $this->login_locked_until = null;
        } else {
            $this->failed_login_attempts++;
            Yii::info($this->failed_login_attempts, '$this->failed_login_attempts');
            switch ($this->failed_login_attempts) {
                case 1:
                    $this->save();
                    throw new ForbiddenHttpException('You have 4 attempts left otherwise your account will be blocked for 30 minutes');
                    break;
                case 2:
                    $this->save();
                    throw new ForbiddenHttpException('You have 3 attempts left otherwise your account will be blocked for 30 minutes');
                    break;
                case 3:
                    $this->save();
                    throw new ForbiddenHttpException('You have 2 attempts left otherwise your account will be blocked for 30 minutes');
                    break;
                case 4:
                    $this->save();
                    throw new ForbiddenHttpException('You have 1 attempts left otherwise your account will be blocked for 30 minutes');
                    break;
                default:
                    $this->login_locked_until = time() + (60 * 30); // Заблокировать на 30 минут
                    $this->save();
---
UPDATE "user" SET "failed_login_attempts"=2 WHERE "id"=14
UPDATE "user" SET "failed_login_attempts"=2 WHERE "id"=12
UPDATE "user" SET "failed_login_attempts"=3 WHERE "id"=12
UPDATE "user" SET "failed_login_attempts"=4 WHERE "id"=12
UPDATE "user" SET "failed_login_attempts"=0 WHERE "id"=14

            }
        }

        $this->save();
---
UPDATE "user" SET "failed_login_attempts"=0 WHERE "id"=12